export const regions = [
  {
    kladr_id: '22',
    value: 'Алтайский край',
    label: 'Алтайский край',
  },
  {
    kladr_id: '28',
    value: 'Амурская область',
    label: 'Амурская область',
  },
  {
    kladr_id: '29',
    value: 'Архангельская область',
    label: 'Архангельская область',
  },
  {
    kladr_id: '30',
    value: 'Астраханская область',
    label: 'Астраханская область',
  },
  {
    kladr_id: '31',
    value: 'Белгородская область',
    label: 'Белгородская область',
  },
  {
    kladr_id: '32',
    value: 'Брянская область',
    label: 'Брянская область',
  },
  {
    kladr_id: '33',
    value: 'Владимирская область',
    label: 'Владимирская область',
  },
  {
    kladr_id: '34',
    value: 'Волгоградская область',
    label: 'Волгоградская область',
  },
  {
    kladr_id: '35',
    value: 'Вологодская область',
    label: 'Вологодская область',
  },
  {
    kladr_id: '36',
    value: 'Воронежская область',
    label: 'Воронежская область',
  },
  {
    kladr_id: '79',
    value: 'Еврейская автономная область',
    label: 'Еврейская автономная область',
  },
  {
    kladr_id: '75',
    value: 'Забайкальский край',
    label: 'Забайкальский край',
  },
  {
    kladr_id: '37',
    value: 'Ивановская область',
    label: 'Ивановская область',
  },
  {
    kladr_id: '38',
    value: 'Иркутская область',
    label: 'Иркутская область',
  },
  {
    kladr_id: '39',
    value: 'Калининградская область',
    label: 'Калининградская область',
  },
  {
    kladr_id: '40',
    value: 'Калужская область',
    label: 'Калужская область',
  },
  {
    kladr_id: '41',
    value: 'Камчатский край',
    label: 'Камчатский край',
  },
  {
    kladr_id: '09',
    value: 'Карачаево-Черкесская Республика',
    label: 'Карачаево-Черкесская Республика',
  },
  {
    kladr_id: '42',
    value: 'Кемеровская область',
    label: 'Кемеровская область',
  },
  {
    kladr_id: '43',
    value: 'Кировская область',
    label: 'Кировская область',
  },
  {
    kladr_id: '44',
    value: 'Костромская область',
    label: 'Костромская область',
  },
  {
    kladr_id: '23',
    value: 'Краснодарский край',
    label: 'Краснодарский край',
  },
  {
    kladr_id: '24',
    value: 'Красноярский край',
    label: 'Красноярский край',
  },
  {
    kladr_id: '45',
    value: 'Курганская область',
    label: 'Курганская область',
  },
  {
    kladr_id: '46',
    value: 'Курская область',
    label: 'Курская область',
  },
  {
    kladr_id: '48',
    value: 'Липецкая область',
    label: 'Липецкая область',
  },
  {
    kladr_id: '49',
    value: 'Магаданская область',
    label: 'Магаданская область',
  },
  {
    kladr_id: ['50', '77'],
    value: 'Москва и Московская область',
    label: 'Москва и Московская область',
  },
  {
    kladr_id: '51',
    value: 'Мурманская область',
    label: 'Мурманская область',
  },
  {
    kladr_id: '83',
    value: 'Ненецкий автономный округ',
    label: 'Ненецкий автономный округ',
  },
  {
    kladr_id: '52',
    value: 'Нижегородская область',
    label: 'Нижегородская область',
  },
  {
    kladr_id: '53',
    value: 'Новгородская область',
    label: 'Новгородская область',
  },
  {
    kladr_id: '54',
    value: 'Новосибирская область',
    label: 'Новосибирская область',
  },
  {
    kladr_id: '55',
    value: 'Омская область',
    label: 'Омская область',
  },
  {
    kladr_id: '56',
    value: 'Оренбургская область',
    label: 'Оренбургская область',
  },
  {
    kladr_id: '57',
    value: 'Орловская область',
    label: 'Орловская область',
  },
  {
    kladr_id: '59',
    value: 'Пермский край',
    label: 'Пермский край',
  },
  {
    kladr_id: '58',
    value: 'Пензенская область',
    label: 'Пензенская область',
  },
  {
    kladr_id: '25',
    value: 'Приморский край',
    label: 'Приморский край',
  },
  {
    kladr_id: '60',
    value: 'Псковская область',
    label: 'Псковская область',
  },
  {
    kladr_id: '01',
    value: 'Республика Адыгея',
    label: 'Республика Адыгея',
  },
  {
    kladr_id: '04',
    value: 'Республика Алтай',
    label: 'Республика Алтай',
  },
  {
    kladr_id: '02',
    value: 'Республика Башкортостан',
    label: 'Республика Башкортостан',
  },
  {
    kladr_id: '03',
    value: 'Республика Бурятия',
    label: 'Республика Бурятия',
  },
  {
    kladr_id: '08',
    value: 'Республика Калмыкия',
    label: 'Республика Калмыкия',
  },
  {
    kladr_id: '10',
    value: 'Республика Карелия',
    label: 'Республика Карелия',
  },
  {
    kladr_id: '11',
    value: 'Республика Коми',
    label: 'Республика Коми',
  },
  {
    kladr_id: '12',
    value: 'Республика Марий Эл',
    label: 'Республика Марий Эл',
  },
  {
    kladr_id: '13',
    value: 'Республика Мордовия',
    label: 'Республика Мордовия',
  },
  {
    kladr_id: '14',
    value: 'Республика Саха(Якутия)',
    label: 'Республика Саха(Якутия)',
  },
  {
    kladr_id: '16',
    value: 'Республика Татарстан',
    label: 'Республика Татарстан',
  },
  {
    kladr_id: '19',
    value: 'Республика Хакасия',
    label: 'Республика Хакасия',
  },
  {
    kladr_id: '61',
    value: 'Ростовская область',
    label: 'Ростовская область',
  },
  {
    kladr_id: '62',
    value: 'Рязанская область',
    label: 'Рязанская область',
  },
  {
    kladr_id: '63',
    value: 'Самарская область',
    label: 'Самарская область',
  },
  {
    kladr_id: ['78', '47'],
    value: 'Санкт-Петербург и Ленинградская область',
    label: 'Санкт-Петербург и Ленинградская область',
  },
  {
    kladr_id: '64',
    value: 'Саратовская область',
    label: 'Саратовская область',
  },
  {
    kladr_id: '65',
    value: 'Сахалинская область',
    label: 'Сахалинская область',
  },
  {
    kladr_id: '66',
    value: 'Свердловская область',
    label: 'Свердловская область',
  },
  {
    kladr_id: '67',
    value: 'Смоленская область',
    label: 'Смоленская область',
  },
  {
    kladr_id: '26',
    value: 'Ставропольский край',
    label: 'Ставропольский край',
  },
  {
    kladr_id: '68',
    value: 'Тамбовская область',
    label: 'Тамбовская область',
  },
  {
    kladr_id: '69',
    value: 'Тверская область',
    label: 'Тверская область',
  },
  {
    kladr_id: '70',
    value: 'Томская область',
    label: 'Томская область',
  },
  {
    kladr_id: '71',
    value: 'Тульская область',
    label: 'Тульская область',
  },
  {
    kladr_id: '72',
    value: 'Тюменская область',
    label: 'Тюменская область',
  },
  {
    kladr_id: '18',
    value: 'Удмуртская Республика',
    label: 'Удмуртская Республика',
  },
  {
    kladr_id: '73',
    value: 'Ульяновская область',
    label: 'Ульяновская область',
  },
  {
    kladr_id: '27',
    value: 'Хабаровский край',
    label: 'Хабаровский край',
  },
  {
    kladr_id: '86',
    value: 'Ханты-Мансийский округ',
    label: 'Ханты-Мансийский округ',
  },
  {
    kladr_id: '74',
    value: 'Челябинская область',
    label: 'Челябинская область',
  },
  {
    kladr_id: '21',
    value: 'Чувашская Республика',
    label: 'Чувашская Республика',
  },
  {
    kladr_id: '87',
    value: 'Чукотский автономный округ',
    label: 'Чукотский автономный округ',
  },
  {
    kladr_id: '76',
    value: 'Ярославская область',
    label: 'Ярославская область',
  },
  {
    kladr_id: '89',
    value: 'Ямало-Ненецкий автономный округ',
    label: 'Ямало-Ненецкий автономный округ',
  },
];
